#include "Game.h"
#include <stdio.h>


Prop propArray[] = {
	{1, "帝皇天烈剑", 1, 5, 5000, Weapon, .minAttack=1, .maxAttack=4, "传说中的一把剑"},
	{2, "破烂的布衣", 2, 5, 10000, Armor, .minDefence=2, .maxDefence=6, "取日月之精华"},
	{3, "玉液琼浆", 3, 5, 15000, Con, .minPower=100, .maxPower=500, "天上的矿泉水" },
};

Map mapArray[8][8] = {
	{
		{1, "天山", 1, {0, 0}, "这里充满了西域文化"},
		{2, "楼兰", 1, {0, 0}, "这里充满了西域文化"},
		{3, "白驼山", 1, {0, 0}, "这里充满了西域文化"},
		{4, "野猪林", 1, {0, 0}, "这里充满了西域文化"},
		{5, "水晶洞", 1, {0, 0}, "这里充满了西域文化"},
		{6, "天蚕洞", 1, {0, 0}, "这里充满了西域文化"},
		{7, "黑风岭", 1, {0, 0}, "这里充满了西域文化"},
		{8, "冰火岛", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{1, "迷宫", 1, {0, 0}, "这里充满了西域文化"},
		{2, "凌霄城", 1, {0, 0}, "这里充满了西域文化"},
		{3, "轩辕岭", 1, {0, 0}, "这里充满了西域文化"},
		{4, "华山", 1, {0, 0}, "这里充满了西域文化"},
		{5, "嵩山", 1, {0, 0}, "这里充满了西域文化"},
		{6, "紫禁城", 1, {0, 0}, "这里充满了西域文化"},
		{7, "快活林", 1, {0, 0}, "这里充满了西域文化"},
		{8, "神龙岛", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{1, "西域", 1, {0, 0}, "这里充满了西域文化"},
		{2, "葫芦岛", 1, {0, 0}, "这里充满了西域文化"},
		{3, "唐门", 1, {0, 0}, "这里充满了西域文化"},
		{4, "终南山", 1, {0, 0}, "这里充满了西域文化"},
		{5, "石窟", 1, {0, 0}, "这里充满了西域文化"},
		{6, "客栈", 1, {0, 0}, "这里充满了西域文化"},
		{7, "玉皇顶", 1, {0, 0}, "这里充满了西域文化"},
		{8, "灵蛇岛", 1, {0, 0}, "这里充满了西域文化"},
	},
	{	
		{1, "光明顶", 1, {0, 0}, "这里充满了西域文化"},
		{2, "摩天崖", 1, {0, 0}, "这里充满了西域文化"},
		{3, "聚贤庄", 1, {0, 0}, "这里充满了西域文化"},
		{4, "后山", 1, {0, 0}, "这里充满了西域文化"},
		{5, "武当山", 1, {0, 0}, "这里充满了西域文化"},
		{6, "开封府", 1, {0, 0}, "这里充满了西域文化"},
		{7, "二十四桥", 1, {0, 0}, "这里充满了西域文化"},
		{8, "蓬莱仙境", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{1, "擂鼓山", 1, {0, 0}, "这里充满了西域文化"},
		{2, "峨眉山", 1, {0, 0}, "这里充满了西域文化"},
		{3, "迷踪林", 1, {0, 0}, "这里充满了西域文化"},
		{4, "五虎岭", 1, {0, 0}, "这里充满了西域文化"},
		{5, "天宁寺", 1, {0, 0}, "这里充满了西域文化"},
		{6, "积善堂", 1, {0, 0}, "这里充满了西域文化"},
		{7, "镇江府", 1, {0, 0}, "这里充满了西域文化"},
		{8, "桃花岛", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{1, "恶人谷", 1, {0, 0}, "这里充满了西域文化"},
		{2, "大理", 1, {0, 0}, "这里充满了西域文化"},
		{3, "百花谷", 1, {0, 0}, "这里充满了西域文化"},
		{4, "孔雀山庄", 1, {0, 0}, "这里充满了西域文化"},
		{5, "五霸岗", 1, {0, 0}, "这里充满了西域文化"},
		{6, "万仞堂", 1, {0, 0}, "这里充满了西域文化"},
		{7, "千年古刹", 1, {0, 0}, "这里充满了西域文化"},
		{8, "六合塔", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{1, "玩具庄", 1, {0, 0}, "这里充满了西域文化"},
		{2, "黑木崖", 1, {0, 0}, "这里充满了西域文化"},
		{3, "蝴蝶谷", 1, {0, 0}, "这里充满了西域文化"},
		{4, "铁花堡", 1, {0, 0}, "这里充满了西域文化"},
		{5, "霹雳堂", 1, {0, 0}, "这里充满了西域文化"},
		{6, "关帝庙", 1, {0, 0}, "这里充满了西域文化"},
		{7, "麒麟庄", 1, {0, 0}, "这里充满了西域文化"},
		{8, "销魂庄", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{1, "石府", 1, {0, 0}, "这里充满了西域文化"},
		{2, "金三角", 1, {0, 0}, "这里充满了西域文化"},
		{3, "忏悔山", 1, {0, 0}, "这里充满了西域文化"},
		{4, "通吃岛", 1, {0, 0}, "这里充满了西域文化"},
		{5, "通天观", 1, {0, 0}, "这里充满了西域文化"},
		{6, "紫霞亭", 1, {0, 0}, "这里充满了西域文化"},
		{7, "天弃庵", 1, {0, 0}, "这里充满了西域文化"},
		{8, "侠客岛", 1, {0, 0}, "这里充满了西域文化"},
	}
};





void Init() //初始化游戏数据
{

}


void Show() //显示全部数据
{
	int propCount = sizeof(propArray) / sizeof(Prop);
	int i, j;
	for (i = 0; i < propCount; i++)
	{
		printf("%d\t%s\t%.0lf\n", propArray[i].id, propArray[i].name, propArray[i].price);
		switch (propArray[i].type)
		{
		case Weapon:
			printf("最小攻击力：%d\t最小攻击力：%d\n", propArray[i].minAttack, propArray[i].maxAttack);
		case Armor:
			printf("最小防御力：%d\t最小防御力：%d\n", propArray[i].minDefence, propArray[i].maxDefence);
		
		}
	}
	printf("\n打印地图信息\n");
	for (i = 0; i < 8; i++)
	{
		for (j = 0; j < 8; j++)
		{
			printf("%-10s", mapArray[i][j].name);
		}
	}
	printf("\n");
}