#include "Game.h"
#include "GameLib.h"
#define SEP "------------------------------------------------------------------------------"
#define COL 78		//游戏界面的总宽度
#define MARGIN_X 20 //左边距
#define MAP_START_Y 3
#define MAP_END_Y 11
#define INFO_START_Y 12
#define MAINMENU_START_Y 20
#define GAME_NAME "笑傲江湖世界"


//假设当前用户的坐标
int X = 3, Y = 2;


Prop propArray[] = {
	{1, "帝皇天烈剑", 1, 5, 5000, Weapon, .minAttack=1, .maxAttack=4, "传说中的一把剑"},
	{2, "破烂的布衣", 2, 5, 10000, Armor, .minDefence=2, .maxDefence=6, "取日月之精华"},
	{3, "玉液琼浆", 3, 5, 15000, Con, .minPower=100, .maxPower=500, "天上的矿泉水" },
};

Map mapArray[8][8] = {
	{
		{1, "天山", 1, {0, 0}, "这里充满了西域文化"},
		{2, "楼兰", 1, {0, 1}, "这里充满了西域文化"},
		{3, "白驼山", 1, {0, 2}, "这里充满了西域文化"},
		{4, "野猪林", 1, {0, 3}, "这里充满了西域文化"},
		{5, "水晶洞", 1, {0, 4}, "这里充满了西域文化"},
		{6, "天蚕洞", 1, {0, 5}, "这里充满了西域文化"},
		{7, "黑风岭", 1, {0, 6}, "这里充满了西域文化"},
		{8, "冰火岛", 1, {0, 7}, "这里充满了西域文化"},
	},
	{
		{9, "迷宫", 1, {0, 0}, "这里充满了西域文化"},
		{10, "凌霄城", 1, {0, 0}, "这里充满了西域文化"},
		{11, "轩辕岭", 1, {0, 0}, "这里充满了西域文化"},
		{12, "华山", 1, {0, 0}, "这里充满了西域文化"},
		{13, "嵩山", 1, {0, 0}, "这里充满了西域文化"},
		{14, "紫禁城", 1, {0, 0}, "这里充满了西域文化"},
		{15, "快活林", 1, {0, 0}, "这里充满了西域文化"},
		{16, "神龙岛", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{17, "西域", 1, {0, 0}, "这里充满了西域文化"},
		{18, "葫芦岛", 1, {0, 0}, "这里充满了西域文化"},
		{19, "唐门", 1, {0, 0}, "这里充满了西域文化"},
		{20, "终南山", 1, {0, 0}, "这里充满了西域文化"},
		{21, "石窟", 1, {0, 0}, "这里充满了西域文化"},
		{22, "客栈", 1, {0, 0}, "这里充满了西域文化"},
		{23, "玉皇顶", 1, {0, 0}, "这里充满了西域文化"},
		{24, "灵蛇岛", 1, {0, 0}, "这里充满了西域文化"},
	},
	{	
		{25, "光明顶", 1, {0, 0}, "这里充满了西域文化"},
		{26, "摩天崖", 1, {0, 0}, "这里充满了西域文化"},
		{27, "聚贤庄", 1, {0, 0}, "这里充满了西域文化"},
		{28, "后山", 1, {0, 0}, "这里充满了西域文化"},
		{29, "武当山", 1, {0, 0}, "这里充满了西域文化"},
		{30, "开封府", 1, {0, 0}, "这里充满了西域文化"},
		{31, "二十四桥", 1, {0, 0}, "这里充满了西域文化"},
		{32, "蓬莱仙境", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{33, "擂鼓山", 1, {0, 0}, "这里充满了西域文化"},
		{34, "峨眉山", 1, {0, 0}, "这里充满了西域文化"},
		{35, "迷踪林", 1, {0, 0}, "这里充满了西域文化"},
		{36, "五虎岭", 1, {0, 0}, "这里充满了西域文化"},
		{37, "天宁寺", 1, {0, 0}, "这里充满了西域文化"},
		{38, "积善堂", 1, {0, 0}, "这里充满了西域文化"},
		{39, "镇江府", 1, {0, 0}, "这里充满了西域文化"},
		{40, "桃花岛", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{41, "恶人谷", 1, {0, 0}, "这里充满了西域文化"},
		{42, "大理", 1, {0, 0}, "这里充满了西域文化"},
		{43, "百花谷", 1, {0, 0}, "这里充满了西域文化"},
		{44, "孔雀山庄", 1, {0, 0}, "这里充满了西域文化"},
		{45, "五霸岗", 1, {0, 0}, "这里充满了西域文化"},
		{46, "万仞堂", 1, {0, 0}, "这里充满了西域文化"},
		{47, "千年古刹", 1, {0, 0}, "这里充满了西域文化"},
		{48, "六合塔", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{49, "玩具庄", 1, {0, 0}, "这里充满了西域文化"},
		{50, "黑木崖", 1, {0, 0}, "这里充满了西域文化"},
		{51, "蝴蝶谷", 1, {0, 0}, "这里充满了西域文化"},
		{52, "铁花堡", 1, {0, 0}, "这里充满了西域文化"},
		{53, "霹雳堂", 1, {0, 0}, "这里充满了西域文化"},
		{54, "关帝庙", 1, {0, 0}, "这里充满了西域文化"},
		{55, "麒麟庄", 1, {0, 0}, "这里充满了西域文化"},
		{56, "销魂庄", 1, {0, 0}, "这里充满了西域文化"},
	},
	{
		{57, "石府", 1, {0, 0}, "这里充满了西域文化"},
		{58, "金三角", 1, {0, 0}, "这里充满了西域文化"},
		{59, "忏悔山", 1, {0, 0}, "这里充满了西域文化"},
		{60, "通吃岛", 1, {0, 0}, "这里充满了西域文化"},
		{61, "通天观", 1, {0, 0}, "这里充满了西域文化"},
		{62, "紫霞亭", 1, {0, 0}, "这里充满了西域文化"},
		{63, "天弃庵", 1, {0, 0}, "这里充满了西域文化"},
		{64, "侠客岛", 1, {0, 0}, "这里充满了西域文化"},
	}
};





void Init() //初始化游戏数据
{

}


void Show() //显示全部数据
{
	int propCount = sizeof(propArray) / sizeof(Prop);
	int i, j;
	for (i = 0; i < propCount; i++)
	{
		printf("%d\t%s\t%.0lf\n", propArray[i].id, propArray[i].name, propArray[i].price);
		switch (propArray[i].type)
		{
		case Weapon:
			printf("最小攻击力：%d\t最小攻击力：%d\n", propArray[i].minAttack, propArray[i].maxAttack);
		case Armor:
			printf("最小防御力：%d\t最小防御力：%d\n", propArray[i].minDefence, propArray[i].maxDefence);
		
		}
	}
	printf("\n打印地图信息\n");
	for (i = 0; i < 8; i++)
	{
		for (j = 0; j < 8; j++)
		{
			printf("%-10s", mapArray[i][j].name);
		}
	}
	printf("\n");
}


//显示游戏欢迎信息
void ShowWelcome()
{
	SetPosition(MARGIN_X, 0);
	printf("%s", SEP);
	SetPosition(MARGIN_X, 1);
	printf("|");
	SetPosition(MARGIN_X + 25, 1);
	printf("欢迎来到笑傲江湖世界");  //游戏名称也定义为常量
	SetPosition(MARGIN_X + 77, 1);
	printf("|");
	SetPosition(MARGIN_X, 2);
	printf("%s\n", SEP);
}




//显示游戏地图
void ShowMap()
{
	//要根据当前玩家的坐标来显示地图的文字
	int i, j;
	printf("\n");
	for (i = 0; i < 8; i++)
	{
		SetPosition(MARGIN_X, 3 + i);
		for (j = 0; j < 8; j++)
		{
			if (j == 0)
			{
				printf("|   ");
			}
			if (i == Y && j == X)
			{
				//更改地图文字的颜色和背景色
				SetColor(5, 15);
			}
			printf("%-9s", mapArray[i][j].name);
			SetColor(10, 0);//打印完特殊地图后，将颜色变回默认
		}
		SetPosition(MARGIN_X + 77, 3 + i);
		printf("|");
	}
	SetPosition(MARGIN_X, MAP_END_Y);
	printf(SEP);
	ShowMapInfo();
	//SetPosition(MARGIN_X + 5, MAINMENU_START_Y + 3);
}

//在信息界面显示当前地图的信息
void ShowMapInfo()
{
	//1. 清除信息窗的信息
	SetPosition(MARGIN_X + 5, INFO_START_Y + 1);
	printf("测试");
	Clear(MARGIN_X, INFO_START_Y, 7);
	//2. 显示当前玩家所在地图的信息
}

//显示游戏地图下方信息
void ShowInfomation() 
{
	//信息窗口共有7行
	SetPosition(MARGIN_X, INFO_START_Y);
	int i;
	for (i = 0; i < 7; i++)
	{
		SetPosition(MARGIN_X, INFO_START_Y + i);
		printf("|");
		SetPosition(MARGIN_X + 77, INFO_START_Y + i);
		printf("|");
	}
	SetPosition(MARGIN_X, INFO_START_Y + 7);
	printf(SEP);
}

//显示游戏主菜单
void ShowMainMenu() 
{
	SetPosition(MARGIN_X, MAINMENU_START_Y);
	printf("游戏菜单：");
	SetPosition(MARGIN_X, MAINMENU_START_Y + 1);
	printf("1、自我欣赏");
	SetPosition(MARGIN_X, MAINMENU_START_Y + 2);
	printf("2、查找怪物");
	SetPosition(MARGIN_X, MAINMENU_START_Y + 3);
	printf("输入指令：");
}
